MikroElektronika/core_packages/PIC/XC8/def/PIC18C858/mcu.h
extern volatile RXF5SIDLbits_t RXF5SIDLbits __at(0xF15);
// bitfield macros
#define _RXF5SIDL_EID16_POSN                                0x0
#define _RXF5SIDL_EID16_POSITION                            0x0
#define _RXF5SIDL_EID16_SIZE                                0x1
#define _RXF5SIDL_EID16_LENGTH                              0x1
#define _RXF5SIDL_EID16_MASK                                0x1
#define _RXF5SIDL_EID17_POSN                                0x1
#define _RXF5SIDL_EID17_POSITION                            0x1
#define _RXF5SIDL_EID17_SIZE                                0x1
#define _RXF5SIDL_EID17_LENGTH                              0x1
#define _RXF5SIDL_EID17_MASK                                0x2
#define _RXF5SIDL_EXIDEN_POSN                               0x3
#define _RXF5SIDL_EXIDEN_POSITION                           0x3
#define _RXF5SIDL_EXIDEN_SIZE                               0x1
#define _RXF5SIDL_EXIDEN_LENGTH                             0x1
#define _RXF5SIDL_EXIDEN_MASK                               0x8
#define _RXF5SIDL_SID0_POSN                                 0x5
#define _RXF5SIDL_SID0_POSITION                             0x5
#define _RXF5SIDL_SID0_SIZE                                 0x1
#define _RXF5SIDL_SID0_LENGTH                               0x1
#define _RXF5SIDL_SID0_MASK                                 0x20
#define _RXF5SIDL_SID1_POSN                                 0x6
#define _RXF5SIDL_SID1_POSITION                             0x6
#define _RXF5SIDL_SID1_SIZE                                 0x1
#define _RXF5SIDL_SID1_LENGTH                               0x1
#define _RXF5SIDL_SID1_MASK                                 0x40
#define _RXF5SIDL_SID2_POSN                                 0x7
#define _RXF5SIDL_SID2_POSITION                             0x7
#define _RXF5SIDL_SID2_SIZE                                 0x1
#define _RXF5SIDL_SID2_LENGTH                               0x1
#define _RXF5SIDL_SID2_MASK                                 0x80
#define _RXF5SIDL_EXIDE_POSN                                0x3
#define _RXF5SIDL_EXIDE_POSITION                            0x3
#define _RXF5SIDL_EXIDE_SIZE                                0x1
#define _RXF5SIDL_EXIDE_LENGTH                              0x1
#define _RXF5SIDL_EXIDE_MASK                                0x8
#define _RXF5SIDL_RXF5EID16_POSN                            0x0
#define _RXF5SIDL_RXF5EID16_POSITION                        0x0
#define _RXF5SIDL_RXF5EID16_SIZE                            0x1
#define _RXF5SIDL_RXF5EID16_LENGTH                          0x1
#define _RXF5SIDL_RXF5EID16_MASK                            0x1
#define _RXF5SIDL_RXF5EID17_POSN                            0x1
#define _RXF5SIDL_RXF5EID17_POSITION                        0x1
#define _RXF5SIDL_RXF5EID17_SIZE                            0x1
#define _RXF5SIDL_RXF5EID17_LENGTH                          0x1
#define _RXF5SIDL_RXF5EID17_MASK                            0x2
#define _RXF5SIDL_RXF5EXIDEN_POSN                           0x3
#define _RXF5SIDL_RXF5EXIDEN_POSITION                       0x3
#define _RXF5SIDL_RXF5EXIDEN_SIZE                           0x1
#define _RXF5SIDL_RXF5EXIDEN_LENGTH                         0x1
#define _RXF5SIDL_RXF5EXIDEN_MASK                           0x8
#define _RXF5SIDL_RXF5SID0_POSN                             0x5
#define _RXF5SIDL_RXF5SID0_POSITION                         0x5
#define _RXF5SIDL_RXF5SID0_SIZE                             0x1
#define _RXF5SIDL_RXF5SID0_LENGTH                           0x1
#define _RXF5SIDL_RXF5SID0_MASK                             0x20
#define _RXF5SIDL_RXF5SID1_POSN                             0x6
#define _RXF5SIDL_RXF5SID1_POSITION                         0x6
#define _RXF5SIDL_RXF5SID1_SIZE                             0x1
#define _RXF5SIDL_RXF5SID1_LENGTH                           0x1
#define _RXF5SIDL_RXF5SID1_MASK                             0x40
#define _RXF5SIDL_RXF5SID2_POSN                             0x7
#define _RXF5SIDL_RXF5SID2_POSITION                         0x7
#define _RXF5SIDL_RXF5SID2_SIZE                             0x1
#define _RXF5SIDL_RXF5SID2_LENGTH                           0x1
#define _RXF5SIDL_RXF5SID2_MASK                             0x80

// Register: RXF5EIDH
#define RXF5EIDH RXF5EIDH
extern volatile unsigned char           RXF5EIDH            __at(0xF16);
#ifndef _LIB_BUILD
asm("RXF5EIDH equ 0F16h");
#endif
// aliases
extern volatile unsigned char           RXF5EID8            __at(0xF16);
#ifndef _LIB_BUILD
asm("RXF5EID8 equ 0F16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF5EID8               :1;
        unsigned RXF5EID9               :1;
        unsigned RXF5EID10              :1;
        unsigned RXF5EID11              :1;
        unsigned RXF5EID12              :1;
        unsigned RXF5EID13              :1;
        unsigned RXF5EID14              :1;
        unsigned RXF5EID15              :1;
    };
} RXF5EIDHbits_t;
extern volatile RXF5EIDHbits_t RXF5EIDHbits __at(0xF16);
// bitfield macros
#define _RXF5EIDH_EID8_POSN                                 0x0
#define _RXF5EIDH_EID8_POSITION                             0x0
#define _RXF5EIDH_EID8_SIZE                                 0x1
#define _RXF5EIDH_EID8_LENGTH                               0x1
#define _RXF5EIDH_EID8_MASK                                 0x1
#define _RXF5EIDH_EID9_POSN                                 0x1
#define _RXF5EIDH_EID9_POSITION                             0x1
#define _RXF5EIDH_EID9_SIZE                                 0x1
#define _RXF5EIDH_EID9_LENGTH                               0x1
#define _RXF5EIDH_EID9_MASK                                 0x2
#define _RXF5EIDH_EID10_POSN                                0x2
#define _RXF5EIDH_EID10_POSITION                            0x2
#define _RXF5EIDH_EID10_SIZE                                0x1
#define _RXF5EIDH_EID10_LENGTH                              0x1
#define _RXF5EIDH_EID10_MASK                                0x4
#define _RXF5EIDH_EID11_POSN                                0x3
#define _RXF5EIDH_EID11_POSITION                            0x3
#define _RXF5EIDH_EID11_SIZE                                0x1
#define _RXF5EIDH_EID11_LENGTH                              0x1
#define _RXF5EIDH_EID11_MASK                                0x8
#define _RXF5EIDH_EID12_POSN                                0x4
#define _RXF5EIDH_EID12_POSITION                            0x4
#define _RXF5EIDH_EID12_SIZE                                0x1
#define _RXF5EIDH_EID12_LENGTH                              0x1
#define _RXF5EIDH_EID12_MASK                                0x10
#define _RXF5EIDH_EID13_POSN                                0x5
#define _RXF5EIDH_EID13_POSITION                            0x5
#define _RXF5EIDH_EID13_SIZE                                0x1
#define _RXF5EIDH_EID13_LENGTH                              0x1
#define _RXF5EIDH_EID13_MASK                                0x20
#define _RXF5EIDH_EID14_POSN                                0x6
#define _RXF5EIDH_EID14_POSITION                            0x6
#define _RXF5EIDH_EID14_SIZE                                0x1
#define _RXF5EIDH_EID14_LENGTH                              0x1
#define _RXF5EIDH_EID14_MASK                                0x40
#define _RXF5EIDH_EID15_POSN                                0x7
#define _RXF5EIDH_EID15_POSITION                            0x7
#define _RXF5EIDH_EID15_SIZE                                0x1
#define _RXF5EIDH_EID15_LENGTH                              0x1
#define _RXF5EIDH_EID15_MASK                                0x80
#define _RXF5EIDH_RXF5EID8_POSN                             0x0
#define _RXF5EIDH_RXF5EID8_POSITION                         0x0
#define _RXF5EIDH_RXF5EID8_SIZE                             0x1
#define _RXF5EIDH_RXF5EID8_LENGTH                           0x1
#define _RXF5EIDH_RXF5EID8_MASK                             0x1
#define _RXF5EIDH_RXF5EID9_POSN                             0x1
#define _RXF5EIDH_RXF5EID9_POSITION                         0x1
#define _RXF5EIDH_RXF5EID9_SIZE                             0x1
#define _RXF5EIDH_RXF5EID9_LENGTH                           0x1
#define _RXF5EIDH_RXF5EID9_MASK                             0x2
#define _RXF5EIDH_RXF5EID10_POSN                            0x2
#define _RXF5EIDH_RXF5EID10_POSITION                        0x2
#define _RXF5EIDH_RXF5EID10_SIZE                            0x1
#define _RXF5EIDH_RXF5EID10_LENGTH                          0x1
#define _RXF5EIDH_RXF5EID10_MASK                            0x4
#define _RXF5EIDH_RXF5EID11_POSN                            0x3
#define _RXF5EIDH_RXF5EID11_POSITION                        0x3
#define _RXF5EIDH_RXF5EID11_SIZE                            0x1
#define _RXF5EIDH_RXF5EID11_LENGTH                          0x1
#define _RXF5EIDH_RXF5EID11_MASK                            0x8
#define _RXF5EIDH_RXF5EID12_POSN                            0x4
#define _RXF5EIDH_RXF5EID12_POSITION                        0x4
#define _RXF5EIDH_RXF5EID12_SIZE                            0x1
#define _RXF5EIDH_RXF5EID12_LENGTH                          0x1
#define _RXF5EIDH_RXF5EID12_MASK                            0x10
#define _RXF5EIDH_RXF5EID13_POSN                            0x5
#define _RXF5EIDH_RXF5EID13_POSITION                        0x5
#define _RXF5EIDH_RXF5EID13_SIZE                            0x1
#define _RXF5EIDH_RXF5EID13_LENGTH                          0x1
#define _RXF5EIDH_RXF5EID13_MASK                            0x20
#define _RXF5EIDH_RXF5EID14_POSN                            0x6
#define _RXF5EIDH_RXF5EID14_POSITION                        0x6
#define _RXF5EIDH_RXF5EID14_SIZE                            0x1
#define _RXF5EIDH_RXF5EID14_LENGTH                          0x1
#define _RXF5EIDH_RXF5EID14_MASK                            0x40
#define _RXF5EIDH_RXF5EID15_POSN                            0x7
#define _RXF5EIDH_RXF5EID15_POSITION                        0x7
#define _RXF5EIDH_RXF5EID15_SIZE                            0x1
#define _RXF5EIDH_RXF5EID15_LENGTH                          0x1
#define _RXF5EIDH_RXF5EID15_MASK                            0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF5EID8               :1;
        unsigned RXF5EID9               :1;
        unsigned RXF5EID10              :1;
        unsigned RXF5EID11              :1;
        unsigned RXF5EID12              :1;
        unsigned RXF5EID13              :1;
        unsigned RXF5EID14              :1;
        unsigned RXF5EID15              :1;
    };
} RXF5EID8bits_t;
