MikroElektronika/core_packages/PIC/XC8/def/PIC18C858/mcu.h
// Register: RXM0EIDH
#define RXM0EIDH RXM0EIDH
extern volatile unsigned char           RXM0EIDH            __at(0xF1A);
#ifndef _LIB_BUILD
asm("RXM0EIDH equ 0F1Ah");
#endif
// aliases
extern volatile unsigned char           RXM0EID8            __at(0xF1A);
#ifndef _LIB_BUILD
asm("RXM0EID8 equ 0F1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXM0EID8               :1;
        unsigned RXM0EID9               :1;
        unsigned RXM0EID10              :1;
        unsigned RXM0EID11              :1;
        unsigned RXM0EID12              :1;
        unsigned RXM0EID13              :1;
        unsigned RXM0EID14              :1;
        unsigned RXM0EID15              :1;
    };
} RXM0EIDHbits_t;
extern volatile RXM0EIDHbits_t RXM0EIDHbits __at(0xF1A);
// bitfield macros
#define _RXM0EIDH_EID8_POSN                                 0x0
#define _RXM0EIDH_EID8_POSITION                             0x0
#define _RXM0EIDH_EID8_SIZE                                 0x1
#define _RXM0EIDH_EID8_LENGTH                               0x1
#define _RXM0EIDH_EID8_MASK                                 0x1
#define _RXM0EIDH_EID9_POSN                                 0x1
#define _RXM0EIDH_EID9_POSITION                             0x1
#define _RXM0EIDH_EID9_SIZE                                 0x1
#define _RXM0EIDH_EID9_LENGTH                               0x1
#define _RXM0EIDH_EID9_MASK                                 0x2
#define _RXM0EIDH_EID10_POSN                                0x2
#define _RXM0EIDH_EID10_POSITION                            0x2
#define _RXM0EIDH_EID10_SIZE                                0x1
#define _RXM0EIDH_EID10_LENGTH                              0x1
#define _RXM0EIDH_EID10_MASK                                0x4
#define _RXM0EIDH_EID11_POSN                                0x3
#define _RXM0EIDH_EID11_POSITION                            0x3
#define _RXM0EIDH_EID11_SIZE                                0x1
#define _RXM0EIDH_EID11_LENGTH                              0x1
#define _RXM0EIDH_EID11_MASK                                0x8
#define _RXM0EIDH_EID12_POSN                                0x4
#define _RXM0EIDH_EID12_POSITION                            0x4
#define _RXM0EIDH_EID12_SIZE                                0x1
#define _RXM0EIDH_EID12_LENGTH                              0x1
#define _RXM0EIDH_EID12_MASK                                0x10
#define _RXM0EIDH_EID13_POSN                                0x5
#define _RXM0EIDH_EID13_POSITION                            0x5
#define _RXM0EIDH_EID13_SIZE                                0x1
#define _RXM0EIDH_EID13_LENGTH                              0x1
#define _RXM0EIDH_EID13_MASK                                0x20
#define _RXM0EIDH_EID14_POSN                                0x6
#define _RXM0EIDH_EID14_POSITION                            0x6
#define _RXM0EIDH_EID14_SIZE                                0x1
#define _RXM0EIDH_EID14_LENGTH                              0x1
#define _RXM0EIDH_EID14_MASK                                0x40
#define _RXM0EIDH_EID15_POSN                                0x7
#define _RXM0EIDH_EID15_POSITION                            0x7
#define _RXM0EIDH_EID15_SIZE                                0x1
#define _RXM0EIDH_EID15_LENGTH                              0x1
#define _RXM0EIDH_EID15_MASK                                0x80
#define _RXM0EIDH_RXM0EID8_POSN                             0x0
#define _RXM0EIDH_RXM0EID8_POSITION                         0x0
#define _RXM0EIDH_RXM0EID8_SIZE                             0x1
#define _RXM0EIDH_RXM0EID8_LENGTH                           0x1
#define _RXM0EIDH_RXM0EID8_MASK                             0x1
#define _RXM0EIDH_RXM0EID9_POSN                             0x1
#define _RXM0EIDH_RXM0EID9_POSITION                         0x1
#define _RXM0EIDH_RXM0EID9_SIZE                             0x1
#define _RXM0EIDH_RXM0EID9_LENGTH                           0x1
#define _RXM0EIDH_RXM0EID9_MASK                             0x2
#define _RXM0EIDH_RXM0EID10_POSN                            0x2
#define _RXM0EIDH_RXM0EID10_POSITION                        0x2
#define _RXM0EIDH_RXM0EID10_SIZE                            0x1
#define _RXM0EIDH_RXM0EID10_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID10_MASK                            0x4
#define _RXM0EIDH_RXM0EID11_POSN                            0x3
#define _RXM0EIDH_RXM0EID11_POSITION                        0x3
#define _RXM0EIDH_RXM0EID11_SIZE                            0x1
#define _RXM0EIDH_RXM0EID11_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID11_MASK                            0x8
#define _RXM0EIDH_RXM0EID12_POSN                            0x4
#define _RXM0EIDH_RXM0EID12_POSITION                        0x4
#define _RXM0EIDH_RXM0EID12_SIZE                            0x1
#define _RXM0EIDH_RXM0EID12_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID12_MASK                            0x10
#define _RXM0EIDH_RXM0EID13_POSN                            0x5
#define _RXM0EIDH_RXM0EID13_POSITION                        0x5
#define _RXM0EIDH_RXM0EID13_SIZE                            0x1
#define _RXM0EIDH_RXM0EID13_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID13_MASK                            0x20
#define _RXM0EIDH_RXM0EID14_POSN                            0x6
#define _RXM0EIDH_RXM0EID14_POSITION                        0x6
#define _RXM0EIDH_RXM0EID14_SIZE                            0x1
#define _RXM0EIDH_RXM0EID14_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID14_MASK                            0x40
#define _RXM0EIDH_RXM0EID15_POSN                            0x7
#define _RXM0EIDH_RXM0EID15_POSITION                        0x7
#define _RXM0EIDH_RXM0EID15_SIZE                            0x1
#define _RXM0EIDH_RXM0EID15_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID15_MASK                            0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXM0EID8               :1;
        unsigned RXM0EID9               :1;
        unsigned RXM0EID10              :1;
        unsigned RXM0EID11              :1;
        unsigned RXM0EID12              :1;
        unsigned RXM0EID13              :1;
        unsigned RXM0EID14              :1;
        unsigned RXM0EID15              :1;
    };
} RXM0EID8bits_t;
extern volatile RXM0EID8bits_t RXM0EID8bits __at(0xF1A);
// bitfield macros
#define _RXM0EID8_EID8_POSN                                 0x0
#define _RXM0EID8_EID8_POSITION                             0x0
#define _RXM0EID8_EID8_SIZE                                 0x1
#define _RXM0EID8_EID8_LENGTH                               0x1
#define _RXM0EID8_EID8_MASK                                 0x1
#define _RXM0EID8_EID9_POSN                                 0x1
#define _RXM0EID8_EID9_POSITION                             0x1
#define _RXM0EID8_EID9_SIZE                                 0x1
#define _RXM0EID8_EID9_LENGTH                               0x1
#define _RXM0EID8_EID9_MASK                                 0x2
#define _RXM0EID8_EID10_POSN                                0x2
#define _RXM0EID8_EID10_POSITION                            0x2
#define _RXM0EID8_EID10_SIZE                                0x1
#define _RXM0EID8_EID10_LENGTH                              0x1
#define _RXM0EID8_EID10_MASK                                0x4
#define _RXM0EID8_EID11_POSN                                0x3
#define _RXM0EID8_EID11_POSITION                            0x3
#define _RXM0EID8_EID11_SIZE                                0x1
#define _RXM0EID8_EID11_LENGTH                              0x1
#define _RXM0EID8_EID11_MASK                                0x8
#define _RXM0EID8_EID12_POSN                                0x4
#define _RXM0EID8_EID12_POSITION                            0x4
#define _RXM0EID8_EID12_SIZE                                0x1
#define _RXM0EID8_EID12_LENGTH                              0x1
#define _RXM0EID8_EID12_MASK                                0x10
#define _RXM0EID8_EID13_POSN                                0x5
#define _RXM0EID8_EID13_POSITION                            0x5
#define _RXM0EID8_EID13_SIZE                                0x1
#define _RXM0EID8_EID13_LENGTH                              0x1
#define _RXM0EID8_EID13_MASK                                0x20
#define _RXM0EID8_EID14_POSN                                0x6
#define _RXM0EID8_EID14_POSITION                            0x6
#define _RXM0EID8_EID14_SIZE                                0x1
#define _RXM0EID8_EID14_LENGTH                              0x1
#define _RXM0EID8_EID14_MASK                                0x40
#define _RXM0EID8_EID15_POSN                                0x7
#define _RXM0EID8_EID15_POSITION                            0x7
#define _RXM0EID8_EID15_SIZE                                0x1
#define _RXM0EID8_EID15_LENGTH                              0x1
#define _RXM0EID8_EID15_MASK                                0x80
#define _RXM0EID8_RXM0EID8_POSN                             0x0
#define _RXM0EID8_RXM0EID8_POSITION                         0x0
#define _RXM0EID8_RXM0EID8_SIZE                             0x1
#define _RXM0EID8_RXM0EID8_LENGTH                           0x1
#define _RXM0EID8_RXM0EID8_MASK                             0x1
#define _RXM0EID8_RXM0EID9_POSN                             0x1
#define _RXM0EID8_RXM0EID9_POSITION                         0x1
#define _RXM0EID8_RXM0EID9_SIZE                             0x1
#define _RXM0EID8_RXM0EID9_LENGTH                           0x1
#define _RXM0EID8_RXM0EID9_MASK                             0x2
#define _RXM0EID8_RXM0EID10_POSN                            0x2
#define _RXM0EID8_RXM0EID10_POSITION                        0x2
#define _RXM0EID8_RXM0EID10_SIZE                            0x1
#define _RXM0EID8_RXM0EID10_LENGTH                          0x1
#define _RXM0EID8_RXM0EID10_MASK                            0x4
#define _RXM0EID8_RXM0EID11_POSN                            0x3
#define _RXM0EID8_RXM0EID11_POSITION                        0x3
#define _RXM0EID8_RXM0EID11_SIZE                            0x1
#define _RXM0EID8_RXM0EID11_LENGTH                          0x1
#define _RXM0EID8_RXM0EID11_MASK                            0x8
#define _RXM0EID8_RXM0EID12_POSN                            0x4
#define _RXM0EID8_RXM0EID12_POSITION                        0x4
#define _RXM0EID8_RXM0EID12_SIZE                            0x1
#define _RXM0EID8_RXM0EID12_LENGTH                          0x1
#define _RXM0EID8_RXM0EID12_MASK                            0x10
#define _RXM0EID8_RXM0EID13_POSN                            0x5
#define _RXM0EID8_RXM0EID13_POSITION                        0x5
#define _RXM0EID8_RXM0EID13_SIZE                            0x1
#define _RXM0EID8_RXM0EID13_LENGTH                          0x1
#define _RXM0EID8_RXM0EID13_MASK                            0x20
#define _RXM0EID8_RXM0EID14_POSN                            0x6
#define _RXM0EID8_RXM0EID14_POSITION                        0x6
#define _RXM0EID8_RXM0EID14_SIZE                            0x1
#define _RXM0EID8_RXM0EID14_LENGTH                          0x1
#define _RXM0EID8_RXM0EID14_MASK                            0x40
#define _RXM0EID8_RXM0EID15_POSN                            0x7
#define _RXM0EID8_RXM0EID15_POSITION                        0x7
#define _RXM0EID8_RXM0EID15_SIZE                            0x1
#define _RXM0EID8_RXM0EID15_LENGTH                          0x1
#define _RXM0EID8_RXM0EID15_MASK                            0x80

// Register: RXM0EIDL
#define RXM0EIDL RXM0EIDL
extern volatile unsigned char           RXM0EIDL            __at(0xF1B);
#ifndef _LIB_BUILD
asm("RXM0EIDL equ 0F1Bh");
#endif
// aliases
extern volatile unsigned char           RXM0EID0            __at(0xF1B);
#ifndef _LIB_BUILD
asm("RXM0EID0 equ 0F1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXM0EID0               :1;
        unsigned RXM0EID1               :1;
        unsigned RXM0EID2               :1;
        unsigned RXM0EID3               :1;
        unsigned RXM0EID4               :1;
        unsigned RXM0EID5               :1;
        unsigned RXM0EID6               :1;
        unsigned RXM0EID7               :1;
    };
} RXM0EIDLbits_t;
extern volatile RXM0EIDLbits_t RXM0EIDLbits __at(0xF1B);
// bitfield macros
#define _RXM0EIDL_EID0_POSN                                 0x0
#define _RXM0EIDL_EID0_POSITION                             0x0
#define _RXM0EIDL_EID0_SIZE                                 0x1
#define _RXM0EIDL_EID0_LENGTH                               0x1
#define _RXM0EIDL_EID0_MASK                                 0x1
#define _RXM0EIDL_EID1_POSN                                 0x1
#define _RXM0EIDL_EID1_POSITION                             0x1
#define _RXM0EIDL_EID1_SIZE                                 0x1
#define _RXM0EIDL_EID1_LENGTH                               0x1
#define _RXM0EIDL_EID1_MASK                                 0x2
#define _RXM0EIDL_EID2_POSN                                 0x2
#define _RXM0EIDL_EID2_POSITION                             0x2
#define _RXM0EIDL_EID2_SIZE                                 0x1
#define _RXM0EIDL_EID2_LENGTH                               0x1
#define _RXM0EIDL_EID2_MASK                                 0x4
#define _RXM0EIDL_EID3_POSN                                 0x3
#define _RXM0EIDL_EID3_POSITION                             0x3
#define _RXM0EIDL_EID3_SIZE                                 0x1
#define _RXM0EIDL_EID3_LENGTH                               0x1
#define _RXM0EIDL_EID3_MASK                                 0x8
#define _RXM0EIDL_EID4_POSN                                 0x4
#define _RXM0EIDL_EID4_POSITION                             0x4
#define _RXM0EIDL_EID4_SIZE                                 0x1
#define _RXM0EIDL_EID4_LENGTH                               0x1
#define _RXM0EIDL_EID4_MASK                                 0x10
#define _RXM0EIDL_EID5_POSN                                 0x5
#define _RXM0EIDL_EID5_POSITION                             0x5
#define _RXM0EIDL_EID5_SIZE                                 0x1
#define _RXM0EIDL_EID5_LENGTH                               0x1
#define _RXM0EIDL_EID5_MASK                                 0x20
#define _RXM0EIDL_EID6_POSN                                 0x6
#define _RXM0EIDL_EID6_POSITION                             0x6
#define _RXM0EIDL_EID6_SIZE                                 0x1
#define _RXM0EIDL_EID6_LENGTH                               0x1
#define _RXM0EIDL_EID6_MASK                                 0x40
#define _RXM0EIDL_EID7_POSN                                 0x7
#define _RXM0EIDL_EID7_POSITION                             0x7
#define _RXM0EIDL_EID7_SIZE                                 0x1
#define _RXM0EIDL_EID7_LENGTH                               0x1
#define _RXM0EIDL_EID7_MASK                                 0x80
#define _RXM0EIDL_RXM0EID0_POSN                             0x0
#define _RXM0EIDL_RXM0EID0_POSITION                         0x0
#define _RXM0EIDL_RXM0EID0_SIZE                             0x1
#define _RXM0EIDL_RXM0EID0_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID0_MASK                             0x1
#define _RXM0EIDL_RXM0EID1_POSN                             0x1
#define _RXM0EIDL_RXM0EID1_POSITION                         0x1
#define _RXM0EIDL_RXM0EID1_SIZE                             0x1
#define _RXM0EIDL_RXM0EID1_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID1_MASK                             0x2
#define _RXM0EIDL_RXM0EID2_POSN                             0x2
#define _RXM0EIDL_RXM0EID2_POSITION                         0x2
#define _RXM0EIDL_RXM0EID2_SIZE                             0x1
#define _RXM0EIDL_RXM0EID2_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID2_MASK                             0x4
#define _RXM0EIDL_RXM0EID3_POSN                             0x3
#define _RXM0EIDL_RXM0EID3_POSITION                         0x3
#define _RXM0EIDL_RXM0EID3_SIZE                             0x1
#define _RXM0EIDL_RXM0EID3_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID3_MASK                             0x8
#define _RXM0EIDL_RXM0EID4_POSN                             0x4
#define _RXM0EIDL_RXM0EID4_POSITION                         0x4
#define _RXM0EIDL_RXM0EID4_SIZE                             0x1
#define _RXM0EIDL_RXM0EID4_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID4_MASK                             0x10
#define _RXM0EIDL_RXM0EID5_POSN                             0x5
#define _RXM0EIDL_RXM0EID5_POSITION                         0x5
#define _RXM0EIDL_RXM0EID5_SIZE                             0x1
#define _RXM0EIDL_RXM0EID5_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID5_MASK                             0x20
#define _RXM0EIDL_RXM0EID6_POSN                             0x6
#define _RXM0EIDL_RXM0EID6_POSITION                         0x6
#define _RXM0EIDL_RXM0EID6_SIZE                             0x1
#define _RXM0EIDL_RXM0EID6_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID6_MASK                             0x40
#define _RXM0EIDL_RXM0EID7_POSN                             0x7
#define _RXM0EIDL_RXM0EID7_POSITION                         0x7
#define _RXM0EIDL_RXM0EID7_SIZE                             0x1
#define _RXM0EIDL_RXM0EID7_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID7_MASK                             0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXM0EID0               :1;
        unsigned RXM0EID1               :1;
        unsigned RXM0EID2               :1;
        unsigned RXM0EID3               :1;
        unsigned RXM0EID4               :1;
        unsigned RXM0EID5               :1;
        unsigned RXM0EID6               :1;
        unsigned RXM0EID7               :1;
    };
} RXM0EID0bits_t;
