MikroElektronika/core_packages/PIC/XC8/def/PIC18C858/mcu.h
extern volatile RXM1EID0bits_t RXM1EID0bits __at(0xF1F);
// bitfield macros
#define _RXM1EID0_EID0_POSN                                 0x0
#define _RXM1EID0_EID0_POSITION                             0x0
#define _RXM1EID0_EID0_SIZE                                 0x1
#define _RXM1EID0_EID0_LENGTH                               0x1
#define _RXM1EID0_EID0_MASK                                 0x1
#define _RXM1EID0_EID1_POSN                                 0x1
#define _RXM1EID0_EID1_POSITION                             0x1
#define _RXM1EID0_EID1_SIZE                                 0x1
#define _RXM1EID0_EID1_LENGTH                               0x1
#define _RXM1EID0_EID1_MASK                                 0x2
#define _RXM1EID0_EID2_POSN                                 0x2
#define _RXM1EID0_EID2_POSITION                             0x2
#define _RXM1EID0_EID2_SIZE                                 0x1
#define _RXM1EID0_EID2_LENGTH                               0x1
#define _RXM1EID0_EID2_MASK                                 0x4
#define _RXM1EID0_EID3_POSN                                 0x3
#define _RXM1EID0_EID3_POSITION                             0x3
#define _RXM1EID0_EID3_SIZE                                 0x1
#define _RXM1EID0_EID3_LENGTH                               0x1
#define _RXM1EID0_EID3_MASK                                 0x8
#define _RXM1EID0_EID4_POSN                                 0x4
#define _RXM1EID0_EID4_POSITION                             0x4
#define _RXM1EID0_EID4_SIZE                                 0x1
#define _RXM1EID0_EID4_LENGTH                               0x1
#define _RXM1EID0_EID4_MASK                                 0x10
#define _RXM1EID0_EID5_POSN                                 0x5
#define _RXM1EID0_EID5_POSITION                             0x5
#define _RXM1EID0_EID5_SIZE                                 0x1
#define _RXM1EID0_EID5_LENGTH                               0x1
#define _RXM1EID0_EID5_MASK                                 0x20
#define _RXM1EID0_EID6_POSN                                 0x6
#define _RXM1EID0_EID6_POSITION                             0x6
#define _RXM1EID0_EID6_SIZE                                 0x1
#define _RXM1EID0_EID6_LENGTH                               0x1
#define _RXM1EID0_EID6_MASK                                 0x40
#define _RXM1EID0_EID7_POSN                                 0x7
#define _RXM1EID0_EID7_POSITION                             0x7
#define _RXM1EID0_EID7_SIZE                                 0x1
#define _RXM1EID0_EID7_LENGTH                               0x1
#define _RXM1EID0_EID7_MASK                                 0x80
#define _RXM1EID0_RXM1EID0_POSN                             0x0
#define _RXM1EID0_RXM1EID0_POSITION                         0x0
#define _RXM1EID0_RXM1EID0_SIZE                             0x1
#define _RXM1EID0_RXM1EID0_LENGTH                           0x1
#define _RXM1EID0_RXM1EID0_MASK                             0x1
#define _RXM1EID0_RXM1EID1_POSN                             0x1
#define _RXM1EID0_RXM1EID1_POSITION                         0x1
#define _RXM1EID0_RXM1EID1_SIZE                             0x1
#define _RXM1EID0_RXM1EID1_LENGTH                           0x1
#define _RXM1EID0_RXM1EID1_MASK                             0x2
#define _RXM1EID0_RXM1EID2_POSN                             0x2
#define _RXM1EID0_RXM1EID2_POSITION                         0x2
#define _RXM1EID0_RXM1EID2_SIZE                             0x1
#define _RXM1EID0_RXM1EID2_LENGTH                           0x1
#define _RXM1EID0_RXM1EID2_MASK                             0x4
#define _RXM1EID0_RXM1EID3_POSN                             0x3
#define _RXM1EID0_RXM1EID3_POSITION                         0x3
#define _RXM1EID0_RXM1EID3_SIZE                             0x1
#define _RXM1EID0_RXM1EID3_LENGTH                           0x1
#define _RXM1EID0_RXM1EID3_MASK                             0x8
#define _RXM1EID0_RXM1EID4_POSN                             0x4
#define _RXM1EID0_RXM1EID4_POSITION                         0x4
#define _RXM1EID0_RXM1EID4_SIZE                             0x1
#define _RXM1EID0_RXM1EID4_LENGTH                           0x1
#define _RXM1EID0_RXM1EID4_MASK                             0x10
#define _RXM1EID0_RXM1EID5_POSN                             0x5
#define _RXM1EID0_RXM1EID5_POSITION                         0x5
#define _RXM1EID0_RXM1EID5_SIZE                             0x1
#define _RXM1EID0_RXM1EID5_LENGTH                           0x1
#define _RXM1EID0_RXM1EID5_MASK                             0x20
#define _RXM1EID0_RXM1EID6_POSN                             0x6
#define _RXM1EID0_RXM1EID6_POSITION                         0x6
#define _RXM1EID0_RXM1EID6_SIZE                             0x1
#define _RXM1EID0_RXM1EID6_LENGTH                           0x1
#define _RXM1EID0_RXM1EID6_MASK                             0x40
#define _RXM1EID0_RXM1EID7_POSN                             0x7
#define _RXM1EID0_RXM1EID7_POSITION                         0x7
#define _RXM1EID0_RXM1EID7_SIZE                             0x1
#define _RXM1EID0_RXM1EID7_LENGTH                           0x1
#define _RXM1EID0_RXM1EID7_MASK                             0x80

// Register: TXB2CON
#define TXB2CON TXB2CON
extern volatile unsigned char           TXB2CON             __at(0xF20);
#ifndef _LIB_BUILD
asm("TXB2CON equ 0F20h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXPRI0                 :1;
        unsigned TXPRI1                 :1;
        unsigned                        :1;
        unsigned TXREQ                  :1;
        unsigned TXERR                  :1;
        unsigned TXLARB                 :1;
        unsigned TXABT                  :1;
    };
    struct {
        unsigned TXB2PRI0               :1;
        unsigned TXB2PRI1               :1;
        unsigned                        :1;
        unsigned TXB2REQ                :1;
        unsigned TXB2ERR                :1;
        unsigned TXB2LARB               :1;
        unsigned TXB2ABT                :1;
    };
} TXB2CONbits_t;
extern volatile TXB2CONbits_t TXB2CONbits __at(0xF20);
// bitfield macros
#define _TXB2CON_TXPRI0_POSN                                0x0
#define _TXB2CON_TXPRI0_POSITION                            0x0
#define _TXB2CON_TXPRI0_SIZE                                0x1
#define _TXB2CON_TXPRI0_LENGTH                              0x1
#define _TXB2CON_TXPRI0_MASK                                0x1
#define _TXB2CON_TXPRI1_POSN                                0x1
#define _TXB2CON_TXPRI1_POSITION                            0x1
#define _TXB2CON_TXPRI1_SIZE                                0x1
#define _TXB2CON_TXPRI1_LENGTH                              0x1
#define _TXB2CON_TXPRI1_MASK                                0x2
#define _TXB2CON_TXREQ_POSN                                 0x3
#define _TXB2CON_TXREQ_POSITION                             0x3
#define _TXB2CON_TXREQ_SIZE                                 0x1
#define _TXB2CON_TXREQ_LENGTH                               0x1
#define _TXB2CON_TXREQ_MASK                                 0x8
#define _TXB2CON_TXERR_POSN                                 0x4
#define _TXB2CON_TXERR_POSITION                             0x4
#define _TXB2CON_TXERR_SIZE                                 0x1
#define _TXB2CON_TXERR_LENGTH                               0x1
#define _TXB2CON_TXERR_MASK                                 0x10
#define _TXB2CON_TXLARB_POSN                                0x5
#define _TXB2CON_TXLARB_POSITION                            0x5
#define _TXB2CON_TXLARB_SIZE                                0x1
#define _TXB2CON_TXLARB_LENGTH                              0x1
#define _TXB2CON_TXLARB_MASK                                0x20
#define _TXB2CON_TXABT_POSN                                 0x6
#define _TXB2CON_TXABT_POSITION                             0x6
#define _TXB2CON_TXABT_SIZE                                 0x1
#define _TXB2CON_TXABT_LENGTH                               0x1
#define _TXB2CON_TXABT_MASK                                 0x40
#define _TXB2CON_TXB2PRI0_POSN                              0x0
#define _TXB2CON_TXB2PRI0_POSITION                          0x0
#define _TXB2CON_TXB2PRI0_SIZE                              0x1
#define _TXB2CON_TXB2PRI0_LENGTH                            0x1
#define _TXB2CON_TXB2PRI0_MASK                              0x1
#define _TXB2CON_TXB2PRI1_POSN                              0x1
#define _TXB2CON_TXB2PRI1_POSITION                          0x1
#define _TXB2CON_TXB2PRI1_SIZE                              0x1
#define _TXB2CON_TXB2PRI1_LENGTH                            0x1
#define _TXB2CON_TXB2PRI1_MASK                              0x2
#define _TXB2CON_TXB2REQ_POSN                               0x3
#define _TXB2CON_TXB2REQ_POSITION                           0x3
#define _TXB2CON_TXB2REQ_SIZE                               0x1
#define _TXB2CON_TXB2REQ_LENGTH                             0x1
#define _TXB2CON_TXB2REQ_MASK                               0x8
#define _TXB2CON_TXB2ERR_POSN                               0x4
#define _TXB2CON_TXB2ERR_POSITION                           0x4
#define _TXB2CON_TXB2ERR_SIZE                               0x1
#define _TXB2CON_TXB2ERR_LENGTH                             0x1
#define _TXB2CON_TXB2ERR_MASK                               0x10
#define _TXB2CON_TXB2LARB_POSN                              0x5
#define _TXB2CON_TXB2LARB_POSITION                          0x5
#define _TXB2CON_TXB2LARB_SIZE                              0x1
#define _TXB2CON_TXB2LARB_LENGTH                            0x1
#define _TXB2CON_TXB2LARB_MASK                              0x20
#define _TXB2CON_TXB2ABT_POSN                               0x6
#define _TXB2CON_TXB2ABT_POSITION                           0x6
#define _TXB2CON_TXB2ABT_SIZE                               0x1
#define _TXB2CON_TXB2ABT_LENGTH                             0x1
#define _TXB2CON_TXB2ABT_MASK                               0x40

// Register: TXB2SIDH
#define TXB2SIDH TXB2SIDH
extern volatile unsigned char           TXB2SIDH            __at(0xF21);
#ifndef _LIB_BUILD
asm("TXB2SIDH equ 0F21h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned TXB2SID3               :1;
        unsigned TXB2SID4               :1;
        unsigned TXB2SID5               :1;
        unsigned TXB2SID6               :1;
        unsigned TXB2SID7               :1;
        unsigned TXB2SID8               :1;
        unsigned TXB2SID9               :1;
        unsigned TXB2SID10              :1;
    };
} TXB2SIDHbits_t;
extern volatile TXB2SIDHbits_t TXB2SIDHbits __at(0xF21);
// bitfield macros
#define _TXB2SIDH_SID3_POSN                                 0x0
#define _TXB2SIDH_SID3_POSITION                             0x0
#define _TXB2SIDH_SID3_SIZE                                 0x1
#define _TXB2SIDH_SID3_LENGTH                               0x1
#define _TXB2SIDH_SID3_MASK                                 0x1
#define _TXB2SIDH_SID4_POSN                                 0x1
#define _TXB2SIDH_SID4_POSITION                             0x1
#define _TXB2SIDH_SID4_SIZE                                 0x1
#define _TXB2SIDH_SID4_LENGTH                               0x1
#define _TXB2SIDH_SID4_MASK                                 0x2
#define _TXB2SIDH_SID5_POSN                                 0x2
#define _TXB2SIDH_SID5_POSITION                             0x2
#define _TXB2SIDH_SID5_SIZE                                 0x1
#define _TXB2SIDH_SID5_LENGTH                               0x1
#define _TXB2SIDH_SID5_MASK                                 0x4
#define _TXB2SIDH_SID6_POSN                                 0x3
#define _TXB2SIDH_SID6_POSITION                             0x3
#define _TXB2SIDH_SID6_SIZE                                 0x1
#define _TXB2SIDH_SID6_LENGTH                               0x1
#define _TXB2SIDH_SID6_MASK                                 0x8
#define _TXB2SIDH_SID7_POSN                                 0x4
#define _TXB2SIDH_SID7_POSITION                             0x4
#define _TXB2SIDH_SID7_SIZE                                 0x1
#define _TXB2SIDH_SID7_LENGTH                               0x1
#define _TXB2SIDH_SID7_MASK                                 0x10
#define _TXB2SIDH_SID8_POSN                                 0x5
#define _TXB2SIDH_SID8_POSITION                             0x5
#define _TXB2SIDH_SID8_SIZE                                 0x1
#define _TXB2SIDH_SID8_LENGTH                               0x1
#define _TXB2SIDH_SID8_MASK                                 0x20
#define _TXB2SIDH_SID9_POSN                                 0x6
#define _TXB2SIDH_SID9_POSITION                             0x6
#define _TXB2SIDH_SID9_SIZE                                 0x1
#define _TXB2SIDH_SID9_LENGTH                               0x1
#define _TXB2SIDH_SID9_MASK                                 0x40
#define _TXB2SIDH_SID10_POSN                                0x7
#define _TXB2SIDH_SID10_POSITION                            0x7
#define _TXB2SIDH_SID10_SIZE                                0x1
#define _TXB2SIDH_SID10_LENGTH                              0x1
#define _TXB2SIDH_SID10_MASK                                0x80
#define _TXB2SIDH_TXB2SID3_POSN                             0x0
#define _TXB2SIDH_TXB2SID3_POSITION                         0x0
#define _TXB2SIDH_TXB2SID3_SIZE                             0x1
#define _TXB2SIDH_TXB2SID3_LENGTH                           0x1
#define _TXB2SIDH_TXB2SID3_MASK                             0x1
#define _TXB2SIDH_TXB2SID4_POSN                             0x1
#define _TXB2SIDH_TXB2SID4_POSITION                         0x1
#define _TXB2SIDH_TXB2SID4_SIZE                             0x1
#define _TXB2SIDH_TXB2SID4_LENGTH                           0x1
#define _TXB2SIDH_TXB2SID4_MASK                             0x2
#define _TXB2SIDH_TXB2SID5_POSN                             0x2
#define _TXB2SIDH_TXB2SID5_POSITION                         0x2
#define _TXB2SIDH_TXB2SID5_SIZE                             0x1
#define _TXB2SIDH_TXB2SID5_LENGTH                           0x1
#define _TXB2SIDH_TXB2SID5_MASK                             0x4
#define _TXB2SIDH_TXB2SID6_POSN                             0x3
#define _TXB2SIDH_TXB2SID6_POSITION                         0x3
#define _TXB2SIDH_TXB2SID6_SIZE                             0x1
#define _TXB2SIDH_TXB2SID6_LENGTH                           0x1
#define _TXB2SIDH_TXB2SID6_MASK                             0x8
#define _TXB2SIDH_TXB2SID7_POSN                             0x4
#define _TXB2SIDH_TXB2SID7_POSITION                         0x4
#define _TXB2SIDH_TXB2SID7_SIZE                             0x1
#define _TXB2SIDH_TXB2SID7_LENGTH                           0x1
#define _TXB2SIDH_TXB2SID7_MASK                             0x10
#define _TXB2SIDH_TXB2SID8_POSN                             0x5
#define _TXB2SIDH_TXB2SID8_POSITION                         0x5
#define _TXB2SIDH_TXB2SID8_SIZE                             0x1
#define _TXB2SIDH_TXB2SID8_LENGTH                           0x1
#define _TXB2SIDH_TXB2SID8_MASK                             0x20
#define _TXB2SIDH_TXB2SID9_POSN                             0x6
#define _TXB2SIDH_TXB2SID9_POSITION                         0x6
#define _TXB2SIDH_TXB2SID9_SIZE                             0x1
#define _TXB2SIDH_TXB2SID9_LENGTH                           0x1
#define _TXB2SIDH_TXB2SID9_MASK                             0x40
#define _TXB2SIDH_TXB2SID10_POSN                            0x7
#define _TXB2SIDH_TXB2SID10_POSITION                        0x7
#define _TXB2SIDH_TXB2SID10_SIZE                            0x1
#define _TXB2SIDH_TXB2SID10_LENGTH                          0x1
#define _TXB2SIDH_TXB2SID10_MASK                            0x80

