MikroElektronika/core_packages/PIC/XC8/def/PIC18C858/mcu.h
extern volatile TXB1EIDHbits_t TXB1EIDHbits __at(0xF33);
// bitfield macros
#define _TXB1EIDH_EID8_POSN                                 0x0
#define _TXB1EIDH_EID8_POSITION                             0x0
#define _TXB1EIDH_EID8_SIZE                                 0x1
#define _TXB1EIDH_EID8_LENGTH                               0x1
#define _TXB1EIDH_EID8_MASK                                 0x1
#define _TXB1EIDH_EID9_POSN                                 0x1
#define _TXB1EIDH_EID9_POSITION                             0x1
#define _TXB1EIDH_EID9_SIZE                                 0x1
#define _TXB1EIDH_EID9_LENGTH                               0x1
#define _TXB1EIDH_EID9_MASK                                 0x2
#define _TXB1EIDH_EID10_POSN                                0x2
#define _TXB1EIDH_EID10_POSITION                            0x2
#define _TXB1EIDH_EID10_SIZE                                0x1
#define _TXB1EIDH_EID10_LENGTH                              0x1
#define _TXB1EIDH_EID10_MASK                                0x4
#define _TXB1EIDH_EID11_POSN                                0x3
#define _TXB1EIDH_EID11_POSITION                            0x3
#define _TXB1EIDH_EID11_SIZE                                0x1
#define _TXB1EIDH_EID11_LENGTH                              0x1
#define _TXB1EIDH_EID11_MASK                                0x8
#define _TXB1EIDH_EID12_POSN                                0x4
#define _TXB1EIDH_EID12_POSITION                            0x4
#define _TXB1EIDH_EID12_SIZE                                0x1
#define _TXB1EIDH_EID12_LENGTH                              0x1
#define _TXB1EIDH_EID12_MASK                                0x10
#define _TXB1EIDH_EID13_POSN                                0x5
#define _TXB1EIDH_EID13_POSITION                            0x5
#define _TXB1EIDH_EID13_SIZE                                0x1
#define _TXB1EIDH_EID13_LENGTH                              0x1
#define _TXB1EIDH_EID13_MASK                                0x20
#define _TXB1EIDH_EID14_POSN                                0x6
#define _TXB1EIDH_EID14_POSITION                            0x6
#define _TXB1EIDH_EID14_SIZE                                0x1
#define _TXB1EIDH_EID14_LENGTH                              0x1
#define _TXB1EIDH_EID14_MASK                                0x40
#define _TXB1EIDH_EID15_POSN                                0x7
#define _TXB1EIDH_EID15_POSITION                            0x7
#define _TXB1EIDH_EID15_SIZE                                0x1
#define _TXB1EIDH_EID15_LENGTH                              0x1
#define _TXB1EIDH_EID15_MASK                                0x80
#define _TXB1EIDH_TXB1EID8_POSN                             0x0
#define _TXB1EIDH_TXB1EID8_POSITION                         0x0
#define _TXB1EIDH_TXB1EID8_SIZE                             0x1
#define _TXB1EIDH_TXB1EID8_LENGTH                           0x1
#define _TXB1EIDH_TXB1EID8_MASK                             0x1
#define _TXB1EIDH_TXB1EID9_POSN                             0x1
#define _TXB1EIDH_TXB1EID9_POSITION                         0x1
#define _TXB1EIDH_TXB1EID9_SIZE                             0x1
#define _TXB1EIDH_TXB1EID9_LENGTH                           0x1
#define _TXB1EIDH_TXB1EID9_MASK                             0x2
#define _TXB1EIDH_TXB1EID10_POSN                            0x2
#define _TXB1EIDH_TXB1EID10_POSITION                        0x2
#define _TXB1EIDH_TXB1EID10_SIZE                            0x1
#define _TXB1EIDH_TXB1EID10_LENGTH                          0x1
#define _TXB1EIDH_TXB1EID10_MASK                            0x4
#define _TXB1EIDH_TXB1EID11_POSN                            0x3
#define _TXB1EIDH_TXB1EID11_POSITION                        0x3
#define _TXB1EIDH_TXB1EID11_SIZE                            0x1
#define _TXB1EIDH_TXB1EID11_LENGTH                          0x1
#define _TXB1EIDH_TXB1EID11_MASK                            0x8
#define _TXB1EIDH_TXB1EID12_POSN                            0x4
#define _TXB1EIDH_TXB1EID12_POSITION                        0x4
#define _TXB1EIDH_TXB1EID12_SIZE                            0x1
#define _TXB1EIDH_TXB1EID12_LENGTH                          0x1
#define _TXB1EIDH_TXB1EID12_MASK                            0x10
#define _TXB1EIDH_TXB1EID13_POSN                            0x5
#define _TXB1EIDH_TXB1EID13_POSITION                        0x5
#define _TXB1EIDH_TXB1EID13_SIZE                            0x1
#define _TXB1EIDH_TXB1EID13_LENGTH                          0x1
#define _TXB1EIDH_TXB1EID13_MASK                            0x20
#define _TXB1EIDH_TXB1EID14_POSN                            0x6
#define _TXB1EIDH_TXB1EID14_POSITION                        0x6
#define _TXB1EIDH_TXB1EID14_SIZE                            0x1
#define _TXB1EIDH_TXB1EID14_LENGTH                          0x1
#define _TXB1EIDH_TXB1EID14_MASK                            0x40
#define _TXB1EIDH_TXB1EID15_POSN                            0x7
#define _TXB1EIDH_TXB1EID15_POSITION                        0x7
#define _TXB1EIDH_TXB1EID15_SIZE                            0x1
#define _TXB1EIDH_TXB1EID15_LENGTH                          0x1
#define _TXB1EIDH_TXB1EID15_MASK                            0x80

// Register: TXB1EIDL
#define TXB1EIDL TXB1EIDL
extern volatile unsigned char           TXB1EIDL            __at(0xF34);
#ifndef _LIB_BUILD
asm("TXB1EIDL equ 0F34h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned TXB1EID0               :1;
        unsigned TXB1EID1               :1;
        unsigned TXB1EID2               :1;
        unsigned TXB1EID3               :1;
        unsigned TXB1EID4               :1;
        unsigned TXB1EID5               :1;
        unsigned TXB1EID6               :1;
        unsigned TXB1EID7               :1;
    };
} TXB1EIDLbits_t;
extern volatile TXB1EIDLbits_t TXB1EIDLbits __at(0xF34);
// bitfield macros
#define _TXB1EIDL_EID0_POSN                                 0x0
#define _TXB1EIDL_EID0_POSITION                             0x0
#define _TXB1EIDL_EID0_SIZE                                 0x1
#define _TXB1EIDL_EID0_LENGTH                               0x1
#define _TXB1EIDL_EID0_MASK                                 0x1
#define _TXB1EIDL_EID1_POSN                                 0x1
#define _TXB1EIDL_EID1_POSITION                             0x1
#define _TXB1EIDL_EID1_SIZE                                 0x1
#define _TXB1EIDL_EID1_LENGTH                               0x1
#define _TXB1EIDL_EID1_MASK                                 0x2
#define _TXB1EIDL_EID2_POSN                                 0x2
#define _TXB1EIDL_EID2_POSITION                             0x2
#define _TXB1EIDL_EID2_SIZE                                 0x1
#define _TXB1EIDL_EID2_LENGTH                               0x1
#define _TXB1EIDL_EID2_MASK                                 0x4
#define _TXB1EIDL_EID3_POSN                                 0x3
#define _TXB1EIDL_EID3_POSITION                             0x3
#define _TXB1EIDL_EID3_SIZE                                 0x1
#define _TXB1EIDL_EID3_LENGTH                               0x1
#define _TXB1EIDL_EID3_MASK                                 0x8
#define _TXB1EIDL_EID4_POSN                                 0x4
#define _TXB1EIDL_EID4_POSITION                             0x4
#define _TXB1EIDL_EID4_SIZE                                 0x1
#define _TXB1EIDL_EID4_LENGTH                               0x1
#define _TXB1EIDL_EID4_MASK                                 0x10
#define _TXB1EIDL_EID5_POSN                                 0x5
#define _TXB1EIDL_EID5_POSITION                             0x5
#define _TXB1EIDL_EID5_SIZE                                 0x1
#define _TXB1EIDL_EID5_LENGTH                               0x1
#define _TXB1EIDL_EID5_MASK                                 0x20
#define _TXB1EIDL_EID6_POSN                                 0x6
#define _TXB1EIDL_EID6_POSITION                             0x6
#define _TXB1EIDL_EID6_SIZE                                 0x1
#define _TXB1EIDL_EID6_LENGTH                               0x1
#define _TXB1EIDL_EID6_MASK                                 0x40
#define _TXB1EIDL_EID7_POSN                                 0x7
#define _TXB1EIDL_EID7_POSITION                             0x7
#define _TXB1EIDL_EID7_SIZE                                 0x1
#define _TXB1EIDL_EID7_LENGTH                               0x1
#define _TXB1EIDL_EID7_MASK                                 0x80
#define _TXB1EIDL_TXB1EID0_POSN                             0x0
#define _TXB1EIDL_TXB1EID0_POSITION                         0x0
#define _TXB1EIDL_TXB1EID0_SIZE                             0x1
#define _TXB1EIDL_TXB1EID0_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID0_MASK                             0x1
#define _TXB1EIDL_TXB1EID1_POSN                             0x1
#define _TXB1EIDL_TXB1EID1_POSITION                         0x1
#define _TXB1EIDL_TXB1EID1_SIZE                             0x1
#define _TXB1EIDL_TXB1EID1_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID1_MASK                             0x2
#define _TXB1EIDL_TXB1EID2_POSN                             0x2
#define _TXB1EIDL_TXB1EID2_POSITION                         0x2
#define _TXB1EIDL_TXB1EID2_SIZE                             0x1
#define _TXB1EIDL_TXB1EID2_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID2_MASK                             0x4
#define _TXB1EIDL_TXB1EID3_POSN                             0x3
#define _TXB1EIDL_TXB1EID3_POSITION                         0x3
#define _TXB1EIDL_TXB1EID3_SIZE                             0x1
#define _TXB1EIDL_TXB1EID3_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID3_MASK                             0x8
#define _TXB1EIDL_TXB1EID4_POSN                             0x4
#define _TXB1EIDL_TXB1EID4_POSITION                         0x4
#define _TXB1EIDL_TXB1EID4_SIZE                             0x1
#define _TXB1EIDL_TXB1EID4_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID4_MASK                             0x10
#define _TXB1EIDL_TXB1EID5_POSN                             0x5
#define _TXB1EIDL_TXB1EID5_POSITION                         0x5
#define _TXB1EIDL_TXB1EID5_SIZE                             0x1
#define _TXB1EIDL_TXB1EID5_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID5_MASK                             0x20
#define _TXB1EIDL_TXB1EID6_POSN                             0x6
#define _TXB1EIDL_TXB1EID6_POSITION                         0x6
#define _TXB1EIDL_TXB1EID6_SIZE                             0x1
#define _TXB1EIDL_TXB1EID6_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID6_MASK                             0x40
#define _TXB1EIDL_TXB1EID7_POSN                             0x7
#define _TXB1EIDL_TXB1EID7_POSITION                         0x7
#define _TXB1EIDL_TXB1EID7_SIZE                             0x1
#define _TXB1EIDL_TXB1EID7_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID7_MASK                             0x80

// Register: TXB1DLC
#define TXB1DLC TXB1DLC
extern volatile unsigned char           TXB1DLC             __at(0xF35);
#ifndef _LIB_BUILD
asm("TXB1DLC equ 0F35h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned                        :2;
        unsigned TXRTR                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned RTR                    :1;
    };
    struct {
        unsigned TXB1DLC0               :1;
        unsigned TXB1DLC1               :1;
        unsigned TXB1DLC2               :1;
        unsigned TXB1DLC3               :1;
        unsigned                        :2;
        unsigned TXB1RTR                :1;
    };
} TXB1DLCbits_t;
extern volatile TXB1DLCbits_t TXB1DLCbits __at(0xF35);
// bitfield macros
#define _TXB1DLC_DLC0_POSN                                  0x0
#define _TXB1DLC_DLC0_POSITION                              0x0
#define _TXB1DLC_DLC0_SIZE                                  0x1
#define _TXB1DLC_DLC0_LENGTH                                0x1
#define _TXB1DLC_DLC0_MASK                                  0x1
#define _TXB1DLC_DLC1_POSN                                  0x1
#define _TXB1DLC_DLC1_POSITION                              0x1
#define _TXB1DLC_DLC1_SIZE                                  0x1
#define _TXB1DLC_DLC1_LENGTH                                0x1
#define _TXB1DLC_DLC1_MASK                                  0x2
#define _TXB1DLC_DLC2_POSN                                  0x2
#define _TXB1DLC_DLC2_POSITION                              0x2
#define _TXB1DLC_DLC2_SIZE                                  0x1
#define _TXB1DLC_DLC2_LENGTH                                0x1
#define _TXB1DLC_DLC2_MASK                                  0x4
#define _TXB1DLC_DLC3_POSN                                  0x3
#define _TXB1DLC_DLC3_POSITION                              0x3
#define _TXB1DLC_DLC3_SIZE                                  0x1
#define _TXB1DLC_DLC3_LENGTH                                0x1
#define _TXB1DLC_DLC3_MASK                                  0x8
#define _TXB1DLC_TXRTR_POSN                                 0x6
#define _TXB1DLC_TXRTR_POSITION                             0x6
#define _TXB1DLC_TXRTR_SIZE                                 0x1
#define _TXB1DLC_TXRTR_LENGTH                               0x1
#define _TXB1DLC_TXRTR_MASK                                 0x40
#define _TXB1DLC_RTR_POSN                                   0x6
#define _TXB1DLC_RTR_POSITION                               0x6
#define _TXB1DLC_RTR_SIZE                                   0x1
#define _TXB1DLC_RTR_LENGTH                                 0x1
#define _TXB1DLC_RTR_MASK                                   0x40
#define _TXB1DLC_TXB1DLC0_POSN                              0x0
#define _TXB1DLC_TXB1DLC0_POSITION                          0x0
#define _TXB1DLC_TXB1DLC0_SIZE                              0x1
#define _TXB1DLC_TXB1DLC0_LENGTH                            0x1
#define _TXB1DLC_TXB1DLC0_MASK                              0x1
#define _TXB1DLC_TXB1DLC1_POSN                              0x1
#define _TXB1DLC_TXB1DLC1_POSITION                          0x1
#define _TXB1DLC_TXB1DLC1_SIZE                              0x1
#define _TXB1DLC_TXB1DLC1_LENGTH                            0x1
#define _TXB1DLC_TXB1DLC1_MASK                              0x2
#define _TXB1DLC_TXB1DLC2_POSN                              0x2
#define _TXB1DLC_TXB1DLC2_POSITION                          0x2
#define _TXB1DLC_TXB1DLC2_SIZE                              0x1
#define _TXB1DLC_TXB1DLC2_LENGTH                            0x1
#define _TXB1DLC_TXB1DLC2_MASK                              0x4
#define _TXB1DLC_TXB1DLC3_POSN                              0x3
#define _TXB1DLC_TXB1DLC3_POSITION                          0x3
#define _TXB1DLC_TXB1DLC3_SIZE                              0x1
#define _TXB1DLC_TXB1DLC3_LENGTH                            0x1
#define _TXB1DLC_TXB1DLC3_MASK                              0x8
#define _TXB1DLC_TXB1RTR_POSN                               0x6
#define _TXB1DLC_TXB1RTR_POSITION                           0x6
#define _TXB1DLC_TXB1RTR_SIZE                               0x1
#define _TXB1DLC_TXB1RTR_LENGTH                             0x1
#define _TXB1DLC_TXB1RTR_MASK                               0x40

// Register: TXB1D0
#define TXB1D0 TXB1D0
extern volatile unsigned char           TXB1D0              __at(0xF36);
#ifndef _LIB_BUILD
asm("TXB1D0 equ 0F36h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB1D00                :1;
        unsigned TXB1D01                :1;
        unsigned TXB1D02                :1;
        unsigned TXB1D03                :1;
        unsigned TXB1D04                :1;
        unsigned TXB1D05                :1;
        unsigned TXB1D06                :1;
        unsigned TXB1D07                :1;
    };
} TXB1D0bits_t;
extern volatile TXB1D0bits_t TXB1D0bits __at(0xF36);
// bitfield macros
#define _TXB1D0_TXB1D00_POSN                                0x0
#define _TXB1D0_TXB1D00_POSITION                            0x0
#define _TXB1D0_TXB1D00_SIZE                                0x1
#define _TXB1D0_TXB1D00_LENGTH                              0x1
#define _TXB1D0_TXB1D00_MASK                                0x1
#define _TXB1D0_TXB1D01_POSN                                0x1
#define _TXB1D0_TXB1D01_POSITION                            0x1
#define _TXB1D0_TXB1D01_SIZE                                0x1
#define _TXB1D0_TXB1D01_LENGTH                              0x1
#define _TXB1D0_TXB1D01_MASK                                0x2
#define _TXB1D0_TXB1D02_POSN                                0x2
#define _TXB1D0_TXB1D02_POSITION                            0x2
#define _TXB1D0_TXB1D02_SIZE                                0x1
#define _TXB1D0_TXB1D02_LENGTH                              0x1
#define _TXB1D0_TXB1D02_MASK                                0x4
#define _TXB1D0_TXB1D03_POSN                                0x3
#define _TXB1D0_TXB1D03_POSITION                            0x3
#define _TXB1D0_TXB1D03_SIZE                                0x1
#define _TXB1D0_TXB1D03_LENGTH                              0x1
#define _TXB1D0_TXB1D03_MASK                                0x8
#define _TXB1D0_TXB1D04_POSN                                0x4
#define _TXB1D0_TXB1D04_POSITION                            0x4
#define _TXB1D0_TXB1D04_SIZE                                0x1
#define _TXB1D0_TXB1D04_LENGTH                              0x1
#define _TXB1D0_TXB1D04_MASK                                0x10
#define _TXB1D0_TXB1D05_POSN                                0x5
#define _TXB1D0_TXB1D05_POSITION                            0x5
#define _TXB1D0_TXB1D05_SIZE                                0x1
#define _TXB1D0_TXB1D05_LENGTH                              0x1
#define _TXB1D0_TXB1D05_MASK                                0x20
#define _TXB1D0_TXB1D06_POSN                                0x6
#define _TXB1D0_TXB1D06_POSITION                            0x6
#define _TXB1D0_TXB1D06_SIZE                                0x1
#define _TXB1D0_TXB1D06_LENGTH                              0x1
#define _TXB1D0_TXB1D06_MASK                                0x40
#define _TXB1D0_TXB1D07_POSN                                0x7
#define _TXB1D0_TXB1D07_POSITION                            0x7
#define _TXB1D0_TXB1D07_SIZE                                0x1
#define _TXB1D0_TXB1D07_LENGTH                              0x1
#define _TXB1D0_TXB1D07_MASK                                0x80

// Register: TXB1D1
#define TXB1D1 TXB1D1
extern volatile unsigned char           TXB1D1              __at(0xF37);
#ifndef _LIB_BUILD
asm("TXB1D1 equ 0F37h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB1D10                :1;
        unsigned TXB1D11                :1;
        unsigned TXB1D12                :1;
        unsigned TXB1D13                :1;
        unsigned TXB1D14                :1;
        unsigned TXB1D15                :1;
        unsigned TXB1D16                :1;
        unsigned TXB1D17                :1;
    };
} TXB1D1bits_t;
