MikroElektronika/core_packages/PIC/XC8/def/PIC18C858/mcu.h
extern volatile TRISKbits_t TRISKbits __at(0xF7F);
// bitfield macros
#define _TRISK_TRISK0_POSN                                  0x0
#define _TRISK_TRISK0_POSITION                              0x0
#define _TRISK_TRISK0_SIZE                                  0x1
#define _TRISK_TRISK0_LENGTH                                0x1
#define _TRISK_TRISK0_MASK                                  0x1
#define _TRISK_TRISK1_POSN                                  0x1
#define _TRISK_TRISK1_POSITION                              0x1
#define _TRISK_TRISK1_SIZE                                  0x1
#define _TRISK_TRISK1_LENGTH                                0x1
#define _TRISK_TRISK1_MASK                                  0x2
#define _TRISK_TRISK2_POSN                                  0x2
#define _TRISK_TRISK2_POSITION                              0x2
#define _TRISK_TRISK2_SIZE                                  0x1
#define _TRISK_TRISK2_LENGTH                                0x1
#define _TRISK_TRISK2_MASK                                  0x4
#define _TRISK_TRISK3_POSN                                  0x3
#define _TRISK_TRISK3_POSITION                              0x3
#define _TRISK_TRISK3_SIZE                                  0x1
#define _TRISK_TRISK3_LENGTH                                0x1
#define _TRISK_TRISK3_MASK                                  0x8
#define _TRISK_TRISK4_POSN                                  0x4
#define _TRISK_TRISK4_POSITION                              0x4
#define _TRISK_TRISK4_SIZE                                  0x1
#define _TRISK_TRISK4_LENGTH                                0x1
#define _TRISK_TRISK4_MASK                                  0x10
#define _TRISK_TRISK5_POSN                                  0x5
#define _TRISK_TRISK5_POSITION                              0x5
#define _TRISK_TRISK5_SIZE                                  0x1
#define _TRISK_TRISK5_LENGTH                                0x1
#define _TRISK_TRISK5_MASK                                  0x20
#define _TRISK_TRISK6_POSN                                  0x6
#define _TRISK_TRISK6_POSITION                              0x6
#define _TRISK_TRISK6_SIZE                                  0x1
#define _TRISK_TRISK6_LENGTH                                0x1
#define _TRISK_TRISK6_MASK                                  0x40
#define _TRISK_TRISK7_POSN                                  0x7
#define _TRISK_TRISK7_POSITION                              0x7
#define _TRISK_TRISK7_SIZE                                  0x1
#define _TRISK_TRISK7_LENGTH                                0x1
#define _TRISK_TRISK7_MASK                                  0x80
#define _TRISK_RK0_POSN                                     0x0
#define _TRISK_RK0_POSITION                                 0x0
#define _TRISK_RK0_SIZE                                     0x1
#define _TRISK_RK0_LENGTH                                   0x1
#define _TRISK_RK0_MASK                                     0x1
#define _TRISK_RK1_POSN                                     0x1
#define _TRISK_RK1_POSITION                                 0x1
#define _TRISK_RK1_SIZE                                     0x1
#define _TRISK_RK1_LENGTH                                   0x1
#define _TRISK_RK1_MASK                                     0x2
#define _TRISK_RK2_POSN                                     0x2
#define _TRISK_RK2_POSITION                                 0x2
#define _TRISK_RK2_SIZE                                     0x1
#define _TRISK_RK2_LENGTH                                   0x1
#define _TRISK_RK2_MASK                                     0x4
#define _TRISK_RK3_POSN                                     0x3
#define _TRISK_RK3_POSITION                                 0x3
#define _TRISK_RK3_SIZE                                     0x1
#define _TRISK_RK3_LENGTH                                   0x1
#define _TRISK_RK3_MASK                                     0x8
#define _TRISK_RK4_POSN                                     0x4
#define _TRISK_RK4_POSITION                                 0x4
#define _TRISK_RK4_SIZE                                     0x1
#define _TRISK_RK4_LENGTH                                   0x1
#define _TRISK_RK4_MASK                                     0x10
#define _TRISK_RK5_POSN                                     0x5
#define _TRISK_RK5_POSITION                                 0x5
#define _TRISK_RK5_SIZE                                     0x1
#define _TRISK_RK5_LENGTH                                   0x1
#define _TRISK_RK5_MASK                                     0x20
#define _TRISK_RK6_POSN                                     0x6
#define _TRISK_RK6_POSITION                                 0x6
#define _TRISK_RK6_SIZE                                     0x1
#define _TRISK_RK6_LENGTH                                   0x1
#define _TRISK_RK6_MASK                                     0x40
#define _TRISK_RK7_POSN                                     0x7
#define _TRISK_RK7_POSITION                                 0x7
#define _TRISK_RK7_SIZE                                     0x1
#define _TRISK_RK7_LENGTH                                   0x1
#define _TRISK_RK7_MASK                                     0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned TRISK0                 :1;
        unsigned TRISK1                 :1;
        unsigned TRISK2                 :1;
        unsigned TRISK3                 :1;
        unsigned TRISK4                 :1;
        unsigned TRISK5                 :1;
        unsigned TRISK6                 :1;
        unsigned TRISK7                 :1;
    };
    struct {
        unsigned RK0                    :1;
        unsigned RK1                    :1;
        unsigned RK2                    :1;
        unsigned RK3                    :1;
        unsigned RK4                    :1;
        unsigned RK5                    :1;
        unsigned RK6                    :1;
        unsigned RK7                    :1;
    };
} DDRKbits_t;
extern volatile DDRKbits_t DDRKbits __at(0xF7F);
// bitfield macros
#define _DDRK_TRISK0_POSN                                   0x0
#define _DDRK_TRISK0_POSITION                               0x0
#define _DDRK_TRISK0_SIZE                                   0x1
#define _DDRK_TRISK0_LENGTH                                 0x1
#define _DDRK_TRISK0_MASK                                   0x1
#define _DDRK_TRISK1_POSN                                   0x1
#define _DDRK_TRISK1_POSITION                               0x1
#define _DDRK_TRISK1_SIZE                                   0x1
#define _DDRK_TRISK1_LENGTH                                 0x1
#define _DDRK_TRISK1_MASK                                   0x2
#define _DDRK_TRISK2_POSN                                   0x2
#define _DDRK_TRISK2_POSITION                               0x2
#define _DDRK_TRISK2_SIZE                                   0x1
#define _DDRK_TRISK2_LENGTH                                 0x1
#define _DDRK_TRISK2_MASK                                   0x4
#define _DDRK_TRISK3_POSN                                   0x3
#define _DDRK_TRISK3_POSITION                               0x3
#define _DDRK_TRISK3_SIZE                                   0x1
#define _DDRK_TRISK3_LENGTH                                 0x1
#define _DDRK_TRISK3_MASK                                   0x8
#define _DDRK_TRISK4_POSN                                   0x4
#define _DDRK_TRISK4_POSITION                               0x4
#define _DDRK_TRISK4_SIZE                                   0x1
#define _DDRK_TRISK4_LENGTH                                 0x1
#define _DDRK_TRISK4_MASK                                   0x10
#define _DDRK_TRISK5_POSN                                   0x5
#define _DDRK_TRISK5_POSITION                               0x5
#define _DDRK_TRISK5_SIZE                                   0x1
#define _DDRK_TRISK5_LENGTH                                 0x1
#define _DDRK_TRISK5_MASK                                   0x20
#define _DDRK_TRISK6_POSN                                   0x6
#define _DDRK_TRISK6_POSITION                               0x6
#define _DDRK_TRISK6_SIZE                                   0x1
#define _DDRK_TRISK6_LENGTH                                 0x1
#define _DDRK_TRISK6_MASK                                   0x40
#define _DDRK_TRISK7_POSN                                   0x7
#define _DDRK_TRISK7_POSITION                               0x7
#define _DDRK_TRISK7_SIZE                                   0x1
#define _DDRK_TRISK7_LENGTH                                 0x1
#define _DDRK_TRISK7_MASK                                   0x80
#define _DDRK_RK0_POSN                                      0x0
#define _DDRK_RK0_POSITION                                  0x0
#define _DDRK_RK0_SIZE                                      0x1
#define _DDRK_RK0_LENGTH                                    0x1
#define _DDRK_RK0_MASK                                      0x1
#define _DDRK_RK1_POSN                                      0x1
#define _DDRK_RK1_POSITION                                  0x1
#define _DDRK_RK1_SIZE                                      0x1
#define _DDRK_RK1_LENGTH                                    0x1
#define _DDRK_RK1_MASK                                      0x2
#define _DDRK_RK2_POSN                                      0x2
#define _DDRK_RK2_POSITION                                  0x2
#define _DDRK_RK2_SIZE                                      0x1
#define _DDRK_RK2_LENGTH                                    0x1
#define _DDRK_RK2_MASK                                      0x4
#define _DDRK_RK3_POSN                                      0x3
#define _DDRK_RK3_POSITION                                  0x3
#define _DDRK_RK3_SIZE                                      0x1
#define _DDRK_RK3_LENGTH                                    0x1
#define _DDRK_RK3_MASK                                      0x8
#define _DDRK_RK4_POSN                                      0x4
#define _DDRK_RK4_POSITION                                  0x4
#define _DDRK_RK4_SIZE                                      0x1
#define _DDRK_RK4_LENGTH                                    0x1
#define _DDRK_RK4_MASK                                      0x10
#define _DDRK_RK5_POSN                                      0x5
#define _DDRK_RK5_POSITION                                  0x5
#define _DDRK_RK5_SIZE                                      0x1
#define _DDRK_RK5_LENGTH                                    0x1
#define _DDRK_RK5_MASK                                      0x20
#define _DDRK_RK6_POSN                                      0x6
#define _DDRK_RK6_POSITION                                  0x6
#define _DDRK_RK6_SIZE                                      0x1
#define _DDRK_RK6_LENGTH                                    0x1
#define _DDRK_RK6_MASK                                      0x40
#define _DDRK_RK7_POSN                                      0x7
#define _DDRK_RK7_POSITION                                  0x7
#define _DDRK_RK7_SIZE                                      0x1
#define _DDRK_RK7_LENGTH                                    0x1
#define _DDRK_RK7_MASK                                      0x80

// Register: PORTA
#define PORTA PORTA
extern volatile unsigned char           PORTA               __at(0xF80);
#ifndef _LIB_BUILD
asm("PORTA equ 0F80h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0                    :1;
        unsigned RA1                    :1;
        unsigned RA2                    :1;
        unsigned RA3                    :1;
        unsigned RA4                    :1;
        unsigned RA5                    :1;
        unsigned RA6                    :1;
    };
    struct {
        unsigned AN0                    :1;
        unsigned AN1                    :1;
        unsigned AN2                    :1;
        unsigned AN3                    :1;
        unsigned                        :1;
        unsigned AN4                    :1;
        unsigned OSC2                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned VREFM                  :1;
        unsigned VREFP                  :1;
        unsigned T0CKI                  :1;
        unsigned SS                     :1;
        unsigned CLK0                   :1;
    };
    struct {
        unsigned                        :5;
        unsigned LVDIN                  :1;
    };
    struct {
        unsigned ULPWUIN                :1;
    };
} PORTAbits_t;
extern volatile PORTAbits_t PORTAbits __at(0xF80);
// bitfield macros
#define _PORTA_RA0_POSN                                     0x0
#define _PORTA_RA0_POSITION                                 0x0
#define _PORTA_RA0_SIZE                                     0x1
#define _PORTA_RA0_LENGTH                                   0x1
#define _PORTA_RA0_MASK                                     0x1
#define _PORTA_RA1_POSN                                     0x1
#define _PORTA_RA1_POSITION                                 0x1
#define _PORTA_RA1_SIZE                                     0x1
#define _PORTA_RA1_LENGTH                                   0x1
#define _PORTA_RA1_MASK                                     0x2
#define _PORTA_RA2_POSN                                     0x2
#define _PORTA_RA2_POSITION                                 0x2
#define _PORTA_RA2_SIZE                                     0x1
#define _PORTA_RA2_LENGTH                                   0x1
#define _PORTA_RA2_MASK                                     0x4
#define _PORTA_RA3_POSN                                     0x3
#define _PORTA_RA3_POSITION                                 0x3
#define _PORTA_RA3_SIZE                                     0x1
#define _PORTA_RA3_LENGTH                                   0x1
#define _PORTA_RA3_MASK                                     0x8
#define _PORTA_RA4_POSN                                     0x4
#define _PORTA_RA4_POSITION                                 0x4
#define _PORTA_RA4_SIZE                                     0x1
#define _PORTA_RA4_LENGTH                                   0x1
#define _PORTA_RA4_MASK                                     0x10
#define _PORTA_RA5_POSN                                     0x5
#define _PORTA_RA5_POSITION                                 0x5
#define _PORTA_RA5_SIZE                                     0x1
#define _PORTA_RA5_LENGTH                                   0x1
#define _PORTA_RA5_MASK                                     0x20
#define _PORTA_RA6_POSN                                     0x6
#define _PORTA_RA6_POSITION                                 0x6
#define _PORTA_RA6_SIZE                                     0x1
#define _PORTA_RA6_LENGTH                                   0x1
#define _PORTA_RA6_MASK                                     0x40
#define _PORTA_AN0_POSN                                     0x0
#define _PORTA_AN0_POSITION                                 0x0
#define _PORTA_AN0_SIZE                                     0x1
#define _PORTA_AN0_LENGTH                                   0x1
#define _PORTA_AN0_MASK                                     0x1
#define _PORTA_AN1_POSN                                     0x1
#define _PORTA_AN1_POSITION                                 0x1
#define _PORTA_AN1_SIZE                                     0x1
#define _PORTA_AN1_LENGTH                                   0x1
#define _PORTA_AN1_MASK                                     0x2
#define _PORTA_AN2_POSN                                     0x2
#define _PORTA_AN2_POSITION                                 0x2
#define _PORTA_AN2_SIZE                                     0x1
#define _PORTA_AN2_LENGTH                                   0x1
#define _PORTA_AN2_MASK                                     0x4
#define _PORTA_AN3_POSN                                     0x3
#define _PORTA_AN3_POSITION                                 0x3
#define _PORTA_AN3_SIZE                                     0x1
#define _PORTA_AN3_LENGTH                                   0x1
#define _PORTA_AN3_MASK                                     0x8
#define _PORTA_AN4_POSN                                     0x5
#define _PORTA_AN4_POSITION                                 0x5
#define _PORTA_AN4_SIZE                                     0x1
#define _PORTA_AN4_LENGTH                                   0x1
#define _PORTA_AN4_MASK                                     0x20
#define _PORTA_OSC2_POSN                                    0x6
#define _PORTA_OSC2_POSITION                                0x6
#define _PORTA_OSC2_SIZE                                    0x1
#define _PORTA_OSC2_LENGTH                                  0x1
#define _PORTA_OSC2_MASK                                    0x40
#define _PORTA_VREFM_POSN                                   0x2
#define _PORTA_VREFM_POSITION                               0x2
#define _PORTA_VREFM_SIZE                                   0x1
#define _PORTA_VREFM_LENGTH                                 0x1
#define _PORTA_VREFM_MASK                                   0x4
#define _PORTA_VREFP_POSN                                   0x3
#define _PORTA_VREFP_POSITION                               0x3
#define _PORTA_VREFP_SIZE                                   0x1
#define _PORTA_VREFP_LENGTH                                 0x1
#define _PORTA_VREFP_MASK                                   0x8
#define _PORTA_T0CKI_POSN                                   0x4
#define _PORTA_T0CKI_POSITION                               0x4
#define _PORTA_T0CKI_SIZE                                   0x1
#define _PORTA_T0CKI_LENGTH                                 0x1
#define _PORTA_T0CKI_MASK                                   0x10
#define _PORTA_SS_POSN                                      0x5
#define _PORTA_SS_POSITION                                  0x5
#define _PORTA_SS_SIZE                                      0x1
#define _PORTA_SS_LENGTH                                    0x1
#define _PORTA_SS_MASK                                      0x20
#define _PORTA_CLK0_POSN                                    0x6
#define _PORTA_CLK0_POSITION                                0x6
#define _PORTA_CLK0_SIZE                                    0x1
#define _PORTA_CLK0_LENGTH                                  0x1
#define _PORTA_CLK0_MASK                                    0x40
#define _PORTA_LVDIN_POSN                                   0x5
#define _PORTA_LVDIN_POSITION                               0x5
#define _PORTA_LVDIN_SIZE                                   0x1
#define _PORTA_LVDIN_LENGTH                                 0x1
#define _PORTA_LVDIN_MASK                                   0x20
#define _PORTA_ULPWUIN_POSN                                 0x0
#define _PORTA_ULPWUIN_POSITION                             0x0
#define _PORTA_ULPWUIN_SIZE                                 0x1
#define _PORTA_ULPWUIN_LENGTH                               0x1
#define _PORTA_ULPWUIN_MASK                                 0x1

// Register: PORTB
#define PORTB PORTB
extern volatile unsigned char           PORTB               __at(0xF81);
#ifndef _LIB_BUILD
asm("PORTB equ 0F81h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RB2                    :1;
        unsigned RB3                    :1;
        unsigned RB4                    :1;
        unsigned RB5                    :1;
        unsigned RB6                    :1;
        unsigned RB7                    :1;
    };
    struct {
        unsigned INT0                   :1;
        unsigned INT1                   :1;
        unsigned INT2                   :1;
        unsigned INT3                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned CCP2_PA2               :1;
    };
} PORTBbits_t;
