MikroElektronika/core_packages/PIC/XC8/def/PIC18C858/mcu.h
// Register: TMR3H
#define TMR3H TMR3H
extern volatile unsigned char           TMR3H               __at(0xFB3);
#ifndef _LIB_BUILD
asm("TMR3H equ 0FB3h");
#endif

// Register: CMCON
#define CMCON CMCON
extern volatile unsigned char           CMCON               __at(0xFB4);
#ifndef _LIB_BUILD
asm("CMCON equ 0FB4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CM                     :3;
        unsigned CIS                    :1;
        unsigned C1INV                  :1;
        unsigned C2INV                  :1;
        unsigned C1OUT                  :1;
        unsigned C2OUT                  :1;
    };
    struct {
        unsigned CM0                    :1;
        unsigned CM1                    :1;
        unsigned CM2                    :1;
    };
    struct {
        unsigned CMEN0                  :1;
        unsigned CMEN1                  :1;
        unsigned CMEN2                  :1;
    };
} CMCONbits_t;
extern volatile CMCONbits_t CMCONbits __at(0xFB4);
// bitfield macros
#define _CMCON_CM_POSN                                      0x0
#define _CMCON_CM_POSITION                                  0x0
#define _CMCON_CM_SIZE                                      0x3
#define _CMCON_CM_LENGTH                                    0x3
#define _CMCON_CM_MASK                                      0x7
#define _CMCON_CIS_POSN                                     0x3
#define _CMCON_CIS_POSITION                                 0x3
#define _CMCON_CIS_SIZE                                     0x1
#define _CMCON_CIS_LENGTH                                   0x1
#define _CMCON_CIS_MASK                                     0x8
#define _CMCON_C1INV_POSN                                   0x4
#define _CMCON_C1INV_POSITION                               0x4
#define _CMCON_C1INV_SIZE                                   0x1
#define _CMCON_C1INV_LENGTH                                 0x1
#define _CMCON_C1INV_MASK                                   0x10
#define _CMCON_C2INV_POSN                                   0x5
#define _CMCON_C2INV_POSITION                               0x5
#define _CMCON_C2INV_SIZE                                   0x1
#define _CMCON_C2INV_LENGTH                                 0x1
#define _CMCON_C2INV_MASK                                   0x20
#define _CMCON_C1OUT_POSN                                   0x6
#define _CMCON_C1OUT_POSITION                               0x6
#define _CMCON_C1OUT_SIZE                                   0x1
#define _CMCON_C1OUT_LENGTH                                 0x1
#define _CMCON_C1OUT_MASK                                   0x40
#define _CMCON_C2OUT_POSN                                   0x7
#define _CMCON_C2OUT_POSITION                               0x7
#define _CMCON_C2OUT_SIZE                                   0x1
#define _CMCON_C2OUT_LENGTH                                 0x1
#define _CMCON_C2OUT_MASK                                   0x80
#define _CMCON_CM0_POSN                                     0x0
#define _CMCON_CM0_POSITION                                 0x0
#define _CMCON_CM0_SIZE                                     0x1
#define _CMCON_CM0_LENGTH                                   0x1
#define _CMCON_CM0_MASK                                     0x1
#define _CMCON_CM1_POSN                                     0x1
#define _CMCON_CM1_POSITION                                 0x1
#define _CMCON_CM1_SIZE                                     0x1
#define _CMCON_CM1_LENGTH                                   0x1
#define _CMCON_CM1_MASK                                     0x2
#define _CMCON_CM2_POSN                                     0x2
#define _CMCON_CM2_POSITION                                 0x2
#define _CMCON_CM2_SIZE                                     0x1
#define _CMCON_CM2_LENGTH                                   0x1
#define _CMCON_CM2_MASK                                     0x4
#define _CMCON_CMEN0_POSN                                   0x0
#define _CMCON_CMEN0_POSITION                               0x0
#define _CMCON_CMEN0_SIZE                                   0x1
#define _CMCON_CMEN0_LENGTH                                 0x1
#define _CMCON_CMEN0_MASK                                   0x1
#define _CMCON_CMEN1_POSN                                   0x1
#define _CMCON_CMEN1_POSITION                               0x1
#define _CMCON_CMEN1_SIZE                                   0x1
#define _CMCON_CMEN1_LENGTH                                 0x1
#define _CMCON_CMEN1_MASK                                   0x2
#define _CMCON_CMEN2_POSN                                   0x2
#define _CMCON_CMEN2_POSITION                               0x2
#define _CMCON_CMEN2_SIZE                                   0x1
#define _CMCON_CMEN2_LENGTH                                 0x1
#define _CMCON_CMEN2_MASK                                   0x4

// Register: CVRCON
#define CVRCON CVRCON
extern volatile unsigned char           CVRCON              __at(0xFB5);
#ifndef _LIB_BUILD
asm("CVRCON equ 0FB5h");
#endif
// aliases
extern volatile unsigned char           VRCON               __at(0xFB5);
#ifndef _LIB_BUILD
asm("VRCON equ 0FB5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VR                     :4;
        unsigned VRSS                   :1;
        unsigned VRR                    :1;
        unsigned VROEN                  :1;
        unsigned VREN                   :1;
    };
    struct {
        unsigned VR0                    :1;
        unsigned VR1                    :1;
        unsigned VR2                    :1;
        unsigned VR3                    :1;
        unsigned                        :1;
        unsigned CRR                    :1;
        unsigned VROE                   :1;
        unsigned CVREN                  :1;
    };
    struct {
        unsigned CVR0                   :1;
        unsigned CVR1                   :1;
        unsigned CVR2                   :1;
        unsigned CVR3                   :1;
        unsigned CVRSS                  :1;
        unsigned CVRR                   :1;
        unsigned CVROEN                 :1;
    };
} CVRCONbits_t;
extern volatile CVRCONbits_t CVRCONbits __at(0xFB5);
// bitfield macros
#define _CVRCON_VR_POSN                                     0x0
#define _CVRCON_VR_POSITION                                 0x0
#define _CVRCON_VR_SIZE                                     0x4
#define _CVRCON_VR_LENGTH                                   0x4
#define _CVRCON_VR_MASK                                     0xF
#define _CVRCON_VRSS_POSN                                   0x4
#define _CVRCON_VRSS_POSITION                               0x4
#define _CVRCON_VRSS_SIZE                                   0x1
#define _CVRCON_VRSS_LENGTH                                 0x1
#define _CVRCON_VRSS_MASK                                   0x10
#define _CVRCON_VRR_POSN                                    0x5
#define _CVRCON_VRR_POSITION                                0x5
#define _CVRCON_VRR_SIZE                                    0x1
#define _CVRCON_VRR_LENGTH                                  0x1
#define _CVRCON_VRR_MASK                                    0x20
#define _CVRCON_VROEN_POSN                                  0x6
#define _CVRCON_VROEN_POSITION                              0x6
#define _CVRCON_VROEN_SIZE                                  0x1
#define _CVRCON_VROEN_LENGTH                                0x1
#define _CVRCON_VROEN_MASK                                  0x40
#define _CVRCON_VREN_POSN                                   0x7
#define _CVRCON_VREN_POSITION                               0x7
#define _CVRCON_VREN_SIZE                                   0x1
#define _CVRCON_VREN_LENGTH                                 0x1
#define _CVRCON_VREN_MASK                                   0x80
#define _CVRCON_VR0_POSN                                    0x0
#define _CVRCON_VR0_POSITION                                0x0
#define _CVRCON_VR0_SIZE                                    0x1
#define _CVRCON_VR0_LENGTH                                  0x1
#define _CVRCON_VR0_MASK                                    0x1
#define _CVRCON_VR1_POSN                                    0x1
#define _CVRCON_VR1_POSITION                                0x1
#define _CVRCON_VR1_SIZE                                    0x1
#define _CVRCON_VR1_LENGTH                                  0x1
#define _CVRCON_VR1_MASK                                    0x2
#define _CVRCON_VR2_POSN                                    0x2
#define _CVRCON_VR2_POSITION                                0x2
#define _CVRCON_VR2_SIZE                                    0x1
#define _CVRCON_VR2_LENGTH                                  0x1
#define _CVRCON_VR2_MASK                                    0x4
#define _CVRCON_VR3_POSN                                    0x3
#define _CVRCON_VR3_POSITION                                0x3
#define _CVRCON_VR3_SIZE                                    0x1
#define _CVRCON_VR3_LENGTH                                  0x1
#define _CVRCON_VR3_MASK                                    0x8
#define _CVRCON_CRR_POSN                                    0x5
#define _CVRCON_CRR_POSITION                                0x5
#define _CVRCON_CRR_SIZE                                    0x1
#define _CVRCON_CRR_LENGTH                                  0x1
#define _CVRCON_CRR_MASK                                    0x20
#define _CVRCON_VROE_POSN                                   0x6
#define _CVRCON_VROE_POSITION                               0x6
#define _CVRCON_VROE_SIZE                                   0x1
#define _CVRCON_VROE_LENGTH                                 0x1
#define _CVRCON_VROE_MASK                                   0x40
#define _CVRCON_CVREN_POSN                                  0x7
#define _CVRCON_CVREN_POSITION                              0x7
#define _CVRCON_CVREN_SIZE                                  0x1
#define _CVRCON_CVREN_LENGTH                                0x1
#define _CVRCON_CVREN_MASK                                  0x80
#define _CVRCON_CVR0_POSN                                   0x0
#define _CVRCON_CVR0_POSITION                               0x0
#define _CVRCON_CVR0_SIZE                                   0x1
#define _CVRCON_CVR0_LENGTH                                 0x1
#define _CVRCON_CVR0_MASK                                   0x1
#define _CVRCON_CVR1_POSN                                   0x1
#define _CVRCON_CVR1_POSITION                               0x1
#define _CVRCON_CVR1_SIZE                                   0x1
#define _CVRCON_CVR1_LENGTH                                 0x1
#define _CVRCON_CVR1_MASK                                   0x2
#define _CVRCON_CVR2_POSN                                   0x2
#define _CVRCON_CVR2_POSITION                               0x2
#define _CVRCON_CVR2_SIZE                                   0x1
#define _CVRCON_CVR2_LENGTH                                 0x1
#define _CVRCON_CVR2_MASK                                   0x4
#define _CVRCON_CVR3_POSN                                   0x3
#define _CVRCON_CVR3_POSITION                               0x3
#define _CVRCON_CVR3_SIZE                                   0x1
#define _CVRCON_CVR3_LENGTH                                 0x1
#define _CVRCON_CVR3_MASK                                   0x8
#define _CVRCON_CVRSS_POSN                                  0x4
#define _CVRCON_CVRSS_POSITION                              0x4
#define _CVRCON_CVRSS_SIZE                                  0x1
#define _CVRCON_CVRSS_LENGTH                                0x1
#define _CVRCON_CVRSS_MASK                                  0x10
#define _CVRCON_CVRR_POSN                                   0x5
#define _CVRCON_CVRR_POSITION                               0x5
#define _CVRCON_CVRR_SIZE                                   0x1
#define _CVRCON_CVRR_LENGTH                                 0x1
#define _CVRCON_CVRR_MASK                                   0x20
#define _CVRCON_CVROEN_POSN                                 0x6
#define _CVRCON_CVROEN_POSITION                             0x6
#define _CVRCON_CVROEN_SIZE                                 0x1
#define _CVRCON_CVROEN_LENGTH                               0x1
#define _CVRCON_CVROEN_MASK                                 0x40
// alias bitfield definitions
typedef union {
    struct {
        unsigned VR                     :4;
        unsigned VRSS                   :1;
        unsigned VRR                    :1;
        unsigned VROEN                  :1;
        unsigned VREN                   :1;
    };
    struct {
        unsigned VR0                    :1;
        unsigned VR1                    :1;
        unsigned VR2                    :1;
        unsigned VR3                    :1;
        unsigned                        :1;
        unsigned CRR                    :1;
        unsigned VROE                   :1;
        unsigned CVREN                  :1;
    };
    struct {
        unsigned CVR0                   :1;
        unsigned CVR1                   :1;
        unsigned CVR2                   :1;
        unsigned CVR3                   :1;
        unsigned CVRSS                  :1;
        unsigned CVRR                   :1;
        unsigned CVROEN                 :1;
    };
} VRCONbits_t;
extern volatile VRCONbits_t VRCONbits __at(0xFB5);
// bitfield macros
#define _VRCON_VR_POSN                                      0x0
#define _VRCON_VR_POSITION                                  0x0
#define _VRCON_VR_SIZE                                      0x4
#define _VRCON_VR_LENGTH                                    0x4
#define _VRCON_VR_MASK                                      0xF
#define _VRCON_VRSS_POSN                                    0x4
#define _VRCON_VRSS_POSITION                                0x4
#define _VRCON_VRSS_SIZE                                    0x1
#define _VRCON_VRSS_LENGTH                                  0x1
#define _VRCON_VRSS_MASK                                    0x10
#define _VRCON_VRR_POSN                                     0x5
#define _VRCON_VRR_POSITION                                 0x5
#define _VRCON_VRR_SIZE                                     0x1
#define _VRCON_VRR_LENGTH                                   0x1
#define _VRCON_VRR_MASK                                     0x20
#define _VRCON_VROEN_POSN                                   0x6
#define _VRCON_VROEN_POSITION                               0x6
#define _VRCON_VROEN_SIZE                                   0x1
#define _VRCON_VROEN_LENGTH                                 0x1
#define _VRCON_VROEN_MASK                                   0x40
#define _VRCON_VREN_POSN                                    0x7
#define _VRCON_VREN_POSITION                                0x7
#define _VRCON_VREN_SIZE                                    0x1
#define _VRCON_VREN_LENGTH                                  0x1
#define _VRCON_VREN_MASK                                    0x80
#define _VRCON_VR0_POSN                                     0x0
#define _VRCON_VR0_POSITION                                 0x0
#define _VRCON_VR0_SIZE                                     0x1
#define _VRCON_VR0_LENGTH                                   0x1
#define _VRCON_VR0_MASK                                     0x1
#define _VRCON_VR1_POSN                                     0x1
#define _VRCON_VR1_POSITION                                 0x1
#define _VRCON_VR1_SIZE                                     0x1
#define _VRCON_VR1_LENGTH                                   0x1
#define _VRCON_VR1_MASK                                     0x2
#define _VRCON_VR2_POSN                                     0x2
#define _VRCON_VR2_POSITION                                 0x2
#define _VRCON_VR2_SIZE                                     0x1
#define _VRCON_VR2_LENGTH                                   0x1
#define _VRCON_VR2_MASK                                     0x4
#define _VRCON_VR3_POSN                                     0x3
#define _VRCON_VR3_POSITION                                 0x3
#define _VRCON_VR3_SIZE                                     0x1
#define _VRCON_VR3_LENGTH                                   0x1
#define _VRCON_VR3_MASK                                     0x8
#define _VRCON_CRR_POSN                                     0x5
#define _VRCON_CRR_POSITION                                 0x5
#define _VRCON_CRR_SIZE                                     0x1
#define _VRCON_CRR_LENGTH                                   0x1
#define _VRCON_CRR_MASK                                     0x20
#define _VRCON_VROE_POSN                                    0x6
#define _VRCON_VROE_POSITION                                0x6
#define _VRCON_VROE_SIZE                                    0x1
#define _VRCON_VROE_LENGTH                                  0x1
#define _VRCON_VROE_MASK                                    0x40
#define _VRCON_CVREN_POSN                                   0x7
#define _VRCON_CVREN_POSITION                               0x7
#define _VRCON_CVREN_SIZE                                   0x1
#define _VRCON_CVREN_LENGTH                                 0x1
#define _VRCON_CVREN_MASK                                   0x80
#define _VRCON_CVR0_POSN                                    0x0
#define _VRCON_CVR0_POSITION                                0x0
#define _VRCON_CVR0_SIZE                                    0x1
#define _VRCON_CVR0_LENGTH                                  0x1
#define _VRCON_CVR0_MASK                                    0x1
#define _VRCON_CVR1_POSN                                    0x1
#define _VRCON_CVR1_POSITION                                0x1
#define _VRCON_CVR1_SIZE                                    0x1
#define _VRCON_CVR1_LENGTH                                  0x1
#define _VRCON_CVR1_MASK                                    0x2
#define _VRCON_CVR2_POSN                                    0x2
#define _VRCON_CVR2_POSITION                                0x2
#define _VRCON_CVR2_SIZE                                    0x1
#define _VRCON_CVR2_LENGTH                                  0x1
#define _VRCON_CVR2_MASK                                    0x4
#define _VRCON_CVR3_POSN                                    0x3
#define _VRCON_CVR3_POSITION                                0x3
#define _VRCON_CVR3_SIZE                                    0x1
#define _VRCON_CVR3_LENGTH                                  0x1
#define _VRCON_CVR3_MASK                                    0x8
#define _VRCON_CVRSS_POSN                                   0x4
#define _VRCON_CVRSS_POSITION                               0x4
#define _VRCON_CVRSS_SIZE                                   0x1
#define _VRCON_CVRSS_LENGTH                                 0x1
#define _VRCON_CVRSS_MASK                                   0x10
#define _VRCON_CVRR_POSN                                    0x5
#define _VRCON_CVRR_POSITION                                0x5
#define _VRCON_CVRR_SIZE                                    0x1
#define _VRCON_CVRR_LENGTH                                  0x1
#define _VRCON_CVRR_MASK                                    0x20
#define _VRCON_CVROEN_POSN                                  0x6
#define _VRCON_CVROEN_POSITION                              0x6
#define _VRCON_CVROEN_SIZE                                  0x1
#define _VRCON_CVROEN_LENGTH                                0x1
#define _VRCON_CVROEN_MASK                                  0x40

// Register: CCP2CON
#define CCP2CON CCP2CON
extern volatile unsigned char           CCP2CON             __at(0xFBA);
#ifndef _LIB_BUILD
asm("CCP2CON equ 0FBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP2M                  :4;
        unsigned DC2B                   :2;
    };
    struct {
        unsigned CCP2M0                 :1;
        unsigned CCP2M1                 :1;
        unsigned CCP2M2                 :1;
        unsigned CCP2M3                 :1;
        unsigned DC2B0                  :1;
        unsigned DC2B1                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned CCPM3                  :1;
        unsigned CCP2Y                  :1;
        unsigned CCP2X                  :1;
    };
    struct {
        unsigned                        :5;
        unsigned DCCPX                  :1;
    };
} CCP2CONbits_t;
